schmmd/soleCAN/embedded/esp32-s3/src/main.cpp
static SdState g_sd;

// Set true once at boot after a successful mount + first session open; gates the
// producer in loop(). Only ever cleared again (mid-session card failure), never
// re-armed until reboot. This flag is the *only* state shared across the core
// boundary — the writer task otherwise sees nothing but bytes in the ring buffers.
volatile bool g_sd_active = false;

static StreamBufferHandle_t g_sd_raw_sb  = nullptr;
static StreamBufferHandle_t g_sd_json_sb = nullptr;
static StaticStreamBuffer_t g_sd_raw_sb_struct;
static StaticStreamBuffer_t g_sd_json_sb_struct;
static uint8_t*             g_sd_raw_storage  = nullptr;
static uint8_t*             g_sd_json_storage = nullptr;

static File    g_sd_raw_file;
static File    g_sd_json_file;
static int64_t g_sd_session_start_us = 0;   // esp_timer µs at session open (log t=0)

// ── Producer side (runs on the loop task, core 1) ──

// Format one frame as a Vector ASCII data line and push it to the raw ring.
// Line-atomic: if the whole line doesn't fit, drop it and count it rather than
// write a fragment or block the CAN drain.
static inline void sdEnqueueRaw(const twai_message_t& msg) {
    char line[96];
    double ts = (esp_timer_get_time() - g_sd_session_start_us) / 1e6;
    int n = snprintf(line, sizeof line, " %.6f 1  %0*lX%s   Rx   d %u",
                     ts, msg.extd ? 8 : 3, (unsigned long)msg.identifier,
                     msg.extd ? "x" : "", (unsigned)msg.data_length_code);
    for (int i = 0; i < msg.data_length_code && n < (int)sizeof line - 4; i++)
        n += snprintf(line + n, sizeof line - n, " %02X", msg.data[i]);
    if (n < (int)sizeof line - 1) line[n++] = '\n';
    if (xStreamBufferSpacesAvailable(g_sd_raw_sb) >= (size_t)n)
        xStreamBufferSend(g_sd_raw_sb, line, n, 0);
    else
        g_sd.raw_dropped++;
}

// Push one JSON snapshot (built by the caller) as a line to the json ring. Only a
// single producer touches the ring, so the space check can't race with a shrink
// (the consumer only frees space), making the two sends effectively atomic.
static inline void sdEnqueueJson(const String& js) {
    size_t len = js.length();
    if (xStreamBufferSpacesAvailable(g_sd_json_sb) >= len + 1) {
        xStreamBufferSend(g_sd_json_sb, js.c_str(), len, 0);
        xStreamBufferSend(g_sd_json_sb, "\n", 1, 0);
    } else {
        g_sd.json_dropped++;
    }
}

// ── Writer side (runs on the dedicated task, core 0) ──

// Vector ASCII header. The ESP32 has no RTC/NTP, so the wall-clock date is
// nominal; what matters to the readers is "base hex" + "timestamps absolute"
// and monotonic per-line timestamps (which are session-relative seconds).
static void sdWriteAscHeader(File& f) {
    f.print("date Thu Jan 1 00:00:00.000 1970\n");
    f.print("base hex  timestamps absolute\n");
    f.print("internal events logged\n");
    f.print("   0.000000 Start of measurement\n");
}

static bool sdOpenRawPart() {
    char path[32];
    snprintf(path, sizeof path, "/s%05lu/raw_%02u.asc",
             (unsigned long)g_sd.session, g_sd.raw_part);
    g_sd_raw_file = SD.open(path, FILE_WRITE);
    if (!g_sd_raw_file) return false;
    sdWriteAscHeader(g_sd_raw_file);
    return true;
}

static bool sdOpenJsonPart() {
    char path[32];
    snprintf(path, sizeof path, "/s%05lu/data_%02u.jsonl",
             (unsigned long)g_sd.session, g_sd.json_part);
    g_sd_json_file = SD.open(path, FILE_WRITE);
    return (bool)g_sd_json_file;
}

// Highest existing /sNNNNN index, or 0 if none. Session number = this + 1, so it
// is monotonic per card and survives reaping and card swaps (no counter file).
static uint32_t sdHighestSession() {
    uint32_t maxn = 0;
    File root = SD.open("/");
    if (!root) return 0;
    for (File e = root.openNextFile(); e; e = root.openNextFile()) {
        if (e.isDirectory()) {
            const char* nm = strrchr(e.name(), '/');
            nm = nm ? nm + 1 : e.name();
            if (nm[0] == 's') {
                uint32_t n = strtoul(nm + 1, nullptr, 10);
                if (n > maxn) maxn = n;
            }
        }
        e.close();
    }
    root.close();
    return maxn;
}

static bool sdStartSession() {
    g_sd.session   = sdHighestSession() + 1;
    g_sd.raw_part  = 0;
    g_sd.json_part = 0;
    char dir[16];
    snprintf(dir, sizeof dir, "/s%05lu", (unsigned long)g_sd.session);
    if (!SD.mkdir(dir)) return false;
    g_sd_session_start_us = esp_timer_get_time();
    if (!sdOpenRawPart()) return false;
    if (!sdOpenJsonPart()) { g_sd_raw_file.close(); return false; }
    return true;
}

// Delete a session directory. Sessions hold only flat files (raw_PP.asc /
// data_PP.jsonl), so remove them one at a time — re-opening the dir each pass
// avoids invalidating the FatFS iterator by deleting during a walk.
static bool sdRemoveSessionDir(const char* path) {
    for (;;) {
        File d = SD.open(path);
        if (!d) return false;
        File e = d.openNextFile();
        if (!e) { d.close(); break; }
        char child[80];
        const char* nm = strrchr(e.name(), '/');
        nm = nm ? nm + 1 : e.name();
        snprintf(child, sizeof child, "%s/%s", path, nm);
        e.close();
        d.close();
        if (!SD.remove(child)) return false;
    }
    return SD.rmdir(path);
}

// Reap the oldest session dir, never the active one. Returns false when there's
// nothing else to delete.
static bool sdReapOldest() {
    uint32_t oldest = 0xFFFFFFFFUL;
    File root = SD.open("/");
    if (!root) return false;
    for (File e = root.openNextFile(); e; e = root.openNextFile()) {
        if (e.isDirectory()) {
            const char* nm = strrchr(e.name(), '/');
            nm = nm ? nm + 1 : e.name();
            if (nm[0] == 's') {
                uint32_t n = strtoul(nm + 1, nullptr, 10);
                if (n < oldest && n != g_sd.session) oldest = n;
            }
        }
        e.close();
    }
    root.close();
    if (oldest == 0xFFFFFFFFUL) return false;
    char path[16];
    snprintf(path, sizeof path, "/s%05lu", (unsigned long)oldest);
    return sdRemoveSessionDir(path);
}

// Refresh free-space figure and reap oldest sessions until we're back above the
// threshold (or only the active session remains).
static void sdUpdateFree() {
    uint64_t total = SD.totalBytes();
    uint64_t used  = SD.usedBytes();
    uint64_t freeb = total > used ? total - used : 0;
    while (freeb < SD_MIN_FREE_BYTES) {
        if (!sdReapOldest()) break;
        used  = SD.usedBytes();
        freeb = total > used ? total - used : 0;
    }
    g_sd.free_mb = (uint32_t)(freeb >> 20);
}

// Part-size accounting. File-scope (not writer-task locals) so a recovery can
// reset them when it opens fresh part files. Writer task (core 0) owns all three.
static uint64_t sd_total_bytes = 0;
static uint64_t sd_raw_part_bytes = 0, sd_json_part_bytes = 0;

// Give up logging for the rest of this boot. The CAN tap keeps running. `op` and
// the running byte count are kept for the /json status so a field failure is
// diagnosable.
static void sdFail(const char* op) {
    g_sd.fail_op = op;
    g_sd.fail_kb = (uint32_t)(sd_total_bytes >> 10);
    g_sd_active  = false;
    g_sd.state   = "error";
    if (g_sd_raw_file)  g_sd_raw_file.close();
    if (g_sd_json_file) g_sd_json_file.close();
    vTaskDelete(nullptr);
}

// An SD call failed mid-session. Observed failure mode on the RejsaCAN: the card
// stops answering CMD13 (SEND_STATUS) under sustained write load — on two
// different cards and both Arduino cores — and a reboot always brings it back.
// So instead of latching "error" on the first bad write, remount and resume the
// same session with fresh part files (bounded attempts, linear backoff). The
// in-flight chunk is discarded (≤512 B); the rings keep absorbing frames while
// we're remounting, so a sub-second recovery usually loses nothing else.
static void sdRecoverOrFail(const char* op) {
    for (int attempt = 1; attempt <= SD_RECOVER_ATTEMPTS; attempt++) {
        g_sd_raw_file.close();
        g_sd_json_file.close();
        SD.end();
        vTaskDelay(pdMS_TO_TICKS(SD_RECOVER_DELAY_MS * attempt));
        if (!SD.begin(SD_CS_PIN)) continue;
        g_sd.raw_part++;
        g_sd.json_part++;
        if (!sdOpenRawPart())  continue;
        if (!sdOpenJsonPart()) continue;
        sd_raw_part_bytes = sd_json_part_bytes = 0;
        g_sd.recoveries++;
        return;
    }
    sdFail(op);   // never returns
}

static void sdWriterTask(void*) {
    static uint8_t buf[SD_WRITE_CHUNK_BYTES];   // static — doesn't fit the task stack
    uint32_t last_flush = millis();
    uint32_t last_free  = millis() - SD_FREE_CHECK_MS;   // check on first idle

