schmmd/soleCAN/embedded/esp32-s3/src/main.cpp
// ── HTTP handlers ─────────────────────────────────────────────────────────────

void handleJson() {
    server.send(200, "application/json", buildJson());
}

// Names for the STA disconnect reasons that come up when a credentials build
// goes wrong: auth_fail / handshake_timeout usually mean a wrong password,
// no_ap_found a wrong SSID or out-of-range network. Rare codes stay numeric.
static String staDisconnectReasonName(uint8_t reason) {
    switch (reason) {
        case WIFI_REASON_UNSPECIFIED:                return "unspecified";
        case WIFI_REASON_AUTH_EXPIRE:                return "auth_expire";
        case WIFI_REASON_AUTH_LEAVE:                 return "auth_leave";
        case WIFI_REASON_ASSOC_EXPIRE:               return "assoc_expire";
        case WIFI_REASON_ASSOC_TOOMANY:              return "assoc_toomany";
        case WIFI_REASON_NOT_AUTHED:                 return "not_authed";
        case WIFI_REASON_NOT_ASSOCED:                return "not_assoced";
        case WIFI_REASON_ASSOC_LEAVE:                return "assoc_leave";
        case WIFI_REASON_MIC_FAILURE:                return "mic_failure";
        case WIFI_REASON_4WAY_HANDSHAKE_TIMEOUT:     return "4way_handshake_timeout";
        case WIFI_REASON_GROUP_KEY_UPDATE_TIMEOUT:   return "group_key_update_timeout";
        case WIFI_REASON_802_1X_AUTH_FAILED:         return "802_1x_auth_failed";
        case WIFI_REASON_BEACON_TIMEOUT:             return "beacon_timeout";
        case WIFI_REASON_NO_AP_FOUND:                return "no_ap_found";
        case WIFI_REASON_AUTH_FAIL:                  return "auth_fail";
        case WIFI_REASON_ASSOC_FAIL:                 return "assoc_fail";
        case WIFI_REASON_HANDSHAKE_TIMEOUT:          return "handshake_timeout";
        case WIFI_REASON_CONNECTION_FAIL:            return "connection_fail";
        case WIFI_REASON_AP_TSF_RESET:               return "ap_tsf_reset";
        case WIFI_REASON_ROAMING:                    return "roaming";
        default:                                     return String(reason);
    }
}

// Build + WiFi diagnostics, deliberately separate from the /json telemetry:
// this reports what was baked into the binary and how the home-network join
// is going. The soft-AP is always up, so /config stays reachable at
// 192.168.4.1 even when the STA join failed — one request distinguishes
// "wrong password" from "wrong SSID" from "built with empty credentials".
void handleConfig() {
    JsonDocument doc;

    doc["uptime"] = millis() / 1000.0;
#ifdef GIT_SHA
    doc["version"] = GIT_SHA;
#endif
#if defined(BOARD_ADAFRUIT_FEATHER_S3)
    doc["board"] = "adafruit_feather_s3";
#elif defined(BOARD_LILYGO_T2CAN)
    doc["board"] = "lilygo_t2can";
#elif defined(BOARD_REJSACAN)
    doc["board"] = "rejsacan";
#endif
    doc["mdns"] = MDNS_NAME;

    auto features = doc["features"].to<JsonObject>();
    features["can_tx"]    = (bool)CAN_TX_ENABLED;
#if defined(HAS_MCP2515)
    features["mcp2515"]   = true;
#else
    features["mcp2515"]   = false;
#endif
#if defined(HAS_VIN_SENSE)
    features["vin_sense"] = true;
#else
    features["vin_sense"] = false;
#endif

    auto wifi = doc["wifi"].to<JsonObject>();

    auto sta = wifi["sta"].to<JsonObject>();
    const bool join_sta = (sizeof(WIFI_SSID) > 1);
    sta["ssid"]     = WIFI_SSID;                    // exactly what was compiled in
    sta["pass_set"] = (sizeof(WIFI_PASS) > 1);      // presence only, never the password
    sta["enabled"]  = join_sta;
    const bool sta_connected = join_sta && WiFi.status() == WL_CONNECTED;
    sta["status"] = !join_sta ? "disabled"
                  : sta_connected ? "connected" : "connecting";
    if (sta_connected) {
        sta["ip"]   = WiFi.localIP().toString();
        sta["rssi"] = WiFi.RSSI();
    }
    sta["disconnects"] = (uint32_t)g_sta_disconnects;
    if (g_sta_disconnects > 0)
        sta["last_disconnect_reason"] =
            staDisconnectReasonName(g_sta_last_disconnect_reason);

    auto ap = wifi["ap"].to<JsonObject>();
    ap["ssid"]    = AP_SSID;
    ap["running"] = g_ap_running;
    if (g_ap_running) {
        ap["ip"]      = WiFi.softAPIP().toString();
        ap["clients"] = WiFi.softAPgetStationNum();
    }

    String out;
    serializeJsonPretty(doc, out);
    server.send(200, "application/json", out);
}

void handleRoot() {
    // HTML lives in src/dashboard.html; embedded via board_build.embed_txtfiles.
    // Length excludes the trailing null byte that embed_txtfiles appends.
    size_t len = dashboard_html_end - dashboard_html_start - 1;
    server.send_P(200, "text/html", (PGM_P)dashboard_html_start, len);
}

void handleNotFound() {
    // The soft-AP's wildcard DNS lands every hostname here, including phone
    // connectivity probes (generate_204 / hotspot-detect.html). Answering
    // those with a redirect — not a 404 — makes the OS classify the AP as a
    // captive portal and auto-open the dashboard when someone joins.
    // localIP() is the board's address on whichever interface (AP or STA)
    // the request arrived on, so bench-network clients redirect sensibly too.
    server.sendHeader("Location",
                      "http://" + server.client().localIP().toString() + "/");
    server.send(302, "text/plain", "");
}

// ── SLCAN ─────────────────────────────────────────────────────────────────────
// Presents the CAN bus as an SLCAN device over USB CDC serial.
// python-can: interface='slcan', channel='/dev/cu.usbmodem...'
// Receive always works; transmit (t/T commands) is gated on -DCAN_ALLOW_TX and
// routes to can0 (the native TWAI controller) only — SLCAN has no channel
// concept, so it never reaches the MCP2515 (can1). A listen-only build answers
// every t/T with BELL.

static char   slcan_buf[32];
static uint8_t slcan_len = 0;
static bool   slcan_open = false;

void slcanSendFrame(const twai_message_t& msg) {
    if (!slcan_open) return;
    char line[32];
    // 'T' + 8 hex ID digits for 29-bit frames, 't' + 3 for 11-bit.
    int n = msg.extd
        ? snprintf(line, sizeof(line), "T%08" PRIX32 "%u",
                   msg.identifier, msg.data_length_code)
        : snprintf(line, sizeof(line), "t%03" PRIX32 "%u",
                   msg.identifier, msg.data_length_code);
    // Bound n so the two hex digits and the trailing '\r' always fit: if n
    // ever passed sizeof(line), the sizeof(line) - n below would underflow
    // and line[n++] would land out of bounds. Unreachable while loop()
    // clamps DLC to 8, but the formatter shouldn't lean on that.
    for (int i = 0; i < msg.data_length_code && n < (int)sizeof(line) - 3; i++)
        n += snprintf(line + n, sizeof(line) - n, "%02X", msg.data[i]);
    line[n++] = '\r';
    Serial.write((uint8_t*)line, n);
}

