schmmd/soleCAN/embedded/esp32-s3/src/main.cpp
void socketcandPoll() {
    WiFiClient new_client = socketcand_server.available();
    if (new_client) {
        int free_idx = -1;
        for (int i = 0; i < SOCKETCAND_NUM_CHANNELS; i++) {
            if (socketcand_slots[i].state == SC_DISCONNECTED) { free_idx = i; break; }
        }
        if (free_idx >= 0) {
            SocketcandSlot& slot = socketcand_slots[free_idx];
            slot.client  = new_client;
            slot.client.setNoDelay(true);
            slot.client.print("< hi >");
            slot.state   = SC_WAITING_OPEN;
            slot.len     = 0;
            slot.channel = -1;
            slot.opened_ms = millis();
        } else {
            new_client.stop();   // pool full — keep the existing clients
        }
    }
    for (auto& slot : socketcand_slots) {
        if (slot.state != SC_DISCONNECTED && !slot.client.connected()) {
            socketcandCloseSlot(slot);
        }
        if ((slot.state == SC_WAITING_OPEN || slot.state == SC_WAITING_RAWMODE)
                && millis() - slot.opened_ms > SOCKETCAND_HANDSHAKE_MS) {
            socketcandCloseSlot(slot);
        }
        while (slot.client && slot.client.available()) {
            char c = slot.client.read();
            if (c == '<') {
                slot.len = 0;
                slot.buf[slot.len++] = c;
            } else if (slot.len > 0 && slot.len < sizeof(slot.buf) - 1) {
                slot.buf[slot.len++] = c;
                if (c == '>') {
                    slot.buf[slot.len] = '\0';
                    socketcandHandleCommand(slot, slot.buf);
                    slot.len = 0;
                }
            }
        }
    }
}

// ── BLE (Nordic UART Service) ─────────────────────────────────────────────────
// Pushes a compact (minimal) JSON snapshot to a single BLE central — every
// BLE_PUSH_INTERVAL_MS while CAN frames are arriving, dropping to a slow
// BLE_HEARTBEAT_MS cadence on a quiet bus. The heartbeat exists because some
// fields change with time rather than with frames (uptime, last_frame_age_s,
// the tractor on/off flag): the client must still see those move after the
// bus goes silent. Framing on the wire is:
//
//     [u16 big-endian length] [length bytes of JSON]
//
// sent across N notifications of up to BLE_CHUNK_BYTES each. The Android
// client reassembles by counting bytes against the length prefix. Connection
// is unpaired — anyone in range with the NUS UUID can subscribe.
//
// MTU: we request 517 server-side; the actual MTU is whatever the client
// negotiates. BLE_CHUNK_BYTES is conservative so a default-MTU client (23)
// would still receive valid (if smaller) packets — but the Android app calls
// requestMtu(517) on connect.
//
// RX characteristic is exposed for future command/control (e.g. reset session
// counters); currently writes are accepted and ignored.

#define NUS_SVC_UUID  "6E400001-B5A3-F393-E0A9-E50E24DCCA9E"
#define NUS_TX_UUID   "6E400003-B5A3-F393-E0A9-E50E24DCCA9E"
#define NUS_RX_UUID   "6E400002-B5A3-F393-E0A9-E50E24DCCA9E"

#define BLE_CHUNK_BYTES        180
#define BLE_PUSH_INTERVAL_MS   200    // push cadence while CAN frames are arriving
#define BLE_HEARTBEAT_MS       2000   // idle cadence — keeps time-derived fields fresh

#define BLE_INTER_CHUNK_DELAY  5      // min ms between chunk notifies (paced by bleTick)

static BLEServer*         g_ble_server = nullptr;
static BLECharacteristic* g_ble_tx     = nullptr;
static volatile bool      g_ble_connected  = false;
static volatile bool      g_ble_force_push = false;
static uint32_t           g_ble_last_push_ms = 0;
static uint32_t           g_ble_frames_at_push = 0;   // g_frames_rx at last push

class BleServerCb : public BLEServerCallbacks {
    // These callbacks run on the Bluedroid task, not loop() — they may only
    // touch the volatile flags, never heap-backed state the loop task owns.
    void onConnect(BLEServer*) override {
        g_ble_connected  = true;
        g_ble_force_push = true;   // full snapshot immediately on (re)connect
    }
    void onDisconnect(BLEServer* s) override {
        g_ble_connected = false;
        s->getAdvertising()->start();   // resume advertising for the next client
    }
};

void bleInit() {
    BLEDevice::init(MDNS_NAME);
    BLEDevice::setMTU(517);

    g_ble_server = BLEDevice::createServer();
    g_ble_server->setCallbacks(new BleServerCb());

    BLEService* svc = g_ble_server->createService(NUS_SVC_UUID);
    g_ble_tx = svc->createCharacteristic(NUS_TX_UUID, BLECharacteristic::PROPERTY_NOTIFY);
    g_ble_tx->addDescriptor(new BLE2902());
    svc->createCharacteristic(NUS_RX_UUID,
        BLECharacteristic::PROPERTY_WRITE | BLECharacteristic::PROPERTY_WRITE_NR);
    svc->start();

    BLEAdvertising* adv = BLEDevice::getAdvertising();
    adv->addServiceUUID(NUS_SVC_UUID);
    adv->setScanResponse(true);
    BLEDevice::startAdvertising();
}

// In-flight framed payload, drained one chunk per bleTick() call so the loop
// never sleeps on BLE (the previous blocking send cost ~25 ms per push).
// 8 KB scratch is plenty: minimal JSON for this dashboard runs ~800 B
// (incl. the per-cell voltage/temperature arrays).
static uint8_t  g_ble_tx_buf[2 + 8192];
static size_t   g_ble_tx_len = 0;   // framed bytes queued; == off when idle
static size_t   g_ble_tx_off = 0;   // next byte to notify
static uint32_t g_ble_chunk_ms = 0; // millis() of the last chunk sent

static void bleQueueFramed(const String& payload) {
    size_t total = payload.length();
    if (total > 65535 || total + 2 > sizeof(g_ble_tx_buf)) return;
    g_ble_tx_buf[0] = (uint8_t)((total >> 8) & 0xFF);
    g_ble_tx_buf[1] = (uint8_t)(total & 0xFF);
    memcpy(g_ble_tx_buf + 2, payload.c_str(), total);
    g_ble_tx_len = 2 + total;
    g_ble_tx_off = 0;
}

void bleTick() {
    if (!g_ble_connected || !g_ble_tx) {
        g_ble_tx_len = g_ble_tx_off = 0;   // abort any in-flight frame
        return;
    }
    uint32_t now = millis();

    // Drain the in-flight frame first — one chunk per tick, keeping the
    // 5 ms inter-chunk spacing on the wire. No new payload is built until
    // the frame completes, so frames are never interleaved.
    if (g_ble_tx_off < g_ble_tx_len) {
        if (now - g_ble_chunk_ms < BLE_INTER_CHUNK_DELAY) return;
        size_t n = g_ble_tx_len - g_ble_tx_off;
        if (n > BLE_CHUNK_BYTES) n = BLE_CHUNK_BYTES;
        g_ble_tx->setValue(g_ble_tx_buf + g_ble_tx_off, n);
        g_ble_tx->notify();
        g_ble_tx_off += n;
        g_ble_chunk_ms = now;
        return;
    }

