schmmd/soleCAN/embedded/esp32-s3/src/main.cpp
    // Adaptive cadence, keyed on frame arrival rather than a payload diff —
    // frames_rx is in the payload, so any received frame changes the JSON
    // and a diff could never suppress a push on an active bus anyway.
    bool bus_active = g_frames_rx != g_ble_frames_at_push;
    uint32_t interval = bus_active ? BLE_PUSH_INTERVAL_MS : BLE_HEARTBEAT_MS;
    if (!g_ble_force_push && now - g_ble_last_push_ms < interval) return;
    g_ble_force_push     = false;
    g_ble_last_push_ms   = now;
    g_ble_frames_at_push = g_frames_rx;
    bleQueueFramed(buildJson(false /*pretty*/, true /*minimal*/));
}

// ── Setup & loop ──────────────────────────────────────────────────────────────

void setup() {
    Serial.begin(115200);

    ledInit();
    ledWrite(4, 4, 4);   // dim white the moment firmware starts running

#if defined(AUTOSHUTDOWN)
    // A wake from deep sleep is a full reboot, so this runs on every wake too.
    // Capture the cause for /json before anything else touches the RTC state.
    g_wake_cause = esp_sleep_get_wakeup_cause();

#if defined(BOARD_REJSACAN)
    // Release the pins checkCanQuietSleep() held through the previous sleep
    // (no-op on a cold boot / power-on reset) before reconfiguring them below.
    gpio_hold_dis(CAN_RS_PIN);
    gpio_hold_dis(FORCE_ON_PIN);
    gpio_hold_dis(WARN_LED_PIN);
    gpio_hold_dis(ACTIVITY_LED_PIN);
    gpio_deep_sleep_hold_dis();
#endif
#endif

#if defined(BOARD_REJSACAN)
    // Drive the transceiver into high-speed normal mode (RS=LOW) and assert
    // the auto-shutdown override so the board stays on across vehicle/key
    // cycles. Both must happen before the TWAI driver starts — otherwise the
    // bus floats and the first frames after boot are lost.
    pinMode(CAN_RS_PIN, OUTPUT);
    digitalWrite(CAN_RS_PIN, LOW);
    pinMode(FORCE_ON_PIN, OUTPUT);
    digitalWrite(FORCE_ON_PIN, HIGH);
#endif

#if defined(ENABLE_KELLY)
    kellyInit();   // Kelly pump monitor on UART1 (GPIO47/48)
#endif

    for (int i = 0; i < NUM_CELLS; i++) g_cell_v[i] = NAN;
    for (int i = 0; i < NUM_TEMPS; i++) g_temp_c[i] = NAN;

    // CAN at 250 kbit/s (J1939 standard). Default rx_queue_len is 5, which
    // overflows whenever the loop stalls — serving the ~26 KB dashboard over
    // HTTP is the longest single handler. A saturated 250 kbit/s bus is
    // ~1800 frames/s, so 512 frames buffer ~280 ms of worst-case traffic
    // (longer at realistic bus load) for ~10 KB of DRAM.
    //
    // Bus mode is set by CAN_TX_ENABLED (see -DCAN_ALLOW_TX up top). Default is
    // LISTEN_ONLY: the controller never transmits — no ACKs, no error frames —
    // so it is electrically incapable of perturbing other nodes, and every TX
    // path (SLCAN injection, socketcand client->bus send) is dead at the
    // silicon level. -DCAN_ALLOW_TX selects NORMAL, which ACKs frames and arms
    // those TX paths.
#if CAN_TX_ENABLED
    const twai_mode_t kCanMode = TWAI_MODE_NORMAL;
#else
    const twai_mode_t kCanMode = TWAI_MODE_LISTEN_ONLY;
#endif
    twai_general_config_t can_cfg = TWAI_GENERAL_CONFIG_DEFAULT(
        CAN_TX_PIN, CAN_RX_PIN, kCanMode);
    can_cfg.rx_queue_len = 512;
    can_cfg.tx_queue_len = 32;
    twai_timing_config_t  tim_cfg = TWAI_TIMING_CONFIG_250KBITS();
    twai_filter_config_t  flt_cfg = TWAI_FILTER_CONFIG_ACCEPT_ALL();
    esp_err_t err = twai_driver_install(&can_cfg, &tim_cfg, &flt_cfg);
    if (err == ESP_OK) {
        err = twai_start();
        if (err == ESP_OK) g_can_initialized = true;
    }

#if !defined(NO_WIFI)
    // Bring up the soft-AP first so the board is always reachable in the field
    // at 192.168.4.1 even if there's no home network in range. STA connect
    // happens in the background; we don't block boot waiting on it.
    //
    // Only enable the station when a home network is actually configured. The
    // AP and STA share one radio: if WIFI_SSID is empty the station would scan
    // every channel forever looking for a network that doesn't exist, which
    // makes the soft-AP beacon hop channels and drop out (it appears briefly
    // then vanishes and won't accept clients). Build with an empty WIFI_SSID
    // for a rock-solid AP-only setup; set it to join a bench network as before.
    // Record STA join outcomes for /config and the serial log. Registered
    // before begin() so even the very first failure is captured. The callback
    // runs on the WiFi event task; it only writes the volatile g_sta_* words.
    // Serial output is suppressed while an SLCAN session is open — the USB
    // serial port is the SLCAN channel, and a stray text line would corrupt
    // the frame stream a python-can client is parsing.
    WiFi.onEvent([](WiFiEvent_t event, WiFiEventInfo_t info) {
        if (event == ARDUINO_EVENT_WIFI_STA_DISCONNECTED) {
            g_sta_last_disconnect_reason = info.wifi_sta_disconnected.reason;
            g_sta_disconnects = g_sta_disconnects + 1;
            if (!slcan_open)
                Serial.printf("WiFi: STA disconnected, reason %u (%s)\r\n",
                              info.wifi_sta_disconnected.reason,
                              staDisconnectReasonName(
                                  info.wifi_sta_disconnected.reason).c_str());
        } else if (event == ARDUINO_EVENT_WIFI_STA_GOT_IP) {
            if (!slcan_open)
                Serial.printf("WiFi: STA connected, IP %s\r\n",
                              WiFi.localIP().toString().c_str());
        }
    });

    const bool join_sta = (sizeof(WIFI_SSID) > 1);
    WiFi.mode(join_sta ? WIFI_AP_STA : WIFI_AP);
    g_ap_running = WiFi.softAP(AP_SSID, AP_PASS);
    if (join_sta) WiFi.begin(WIFI_SSID, WIFI_PASS);

    if (join_sta)
        Serial.printf("WiFi: AP \"%s\" %s; STA joining \"%s\" (pass %u chars)\r\n",
                      AP_SSID, g_ap_running ? "up" : "FAILED",
                      WIFI_SSID, (unsigned)(sizeof(WIFI_PASS) - 1));
    else
        Serial.printf("WiFi: AP \"%s\" %s; STA disabled (no WIFI_SSID baked in)\r\n",
                      AP_SSID, g_ap_running ? "up" : "FAILED");

    // Wildcard DNS on the soft-AP: any hostname (tractor.local, tractor,
    // captive-portal probes, etc.) resolves to the board's AP IP. Needed
    // because phones generally don't do mDNS over an AP with no internet.
    if (g_ap_running) dns_server.start(53, "*", WiFi.softAPIP());

    MDNS.begin(MDNS_NAME);

    server.on("/",       handleRoot);
    server.on("/json",   handleJson);
    server.on("/config", handleConfig);
    server.onNotFound(handleNotFound);
    server.begin();
    MDNS.addService("http", "tcp", 80);

