schmmd/soleCAN/embedded/esp32-s3/src/main.cpp
    socketcand_server.begin();
    socketcand_server.setNoDelay(true);
    MDNS.addService("socketcand", "tcp", SOCKETCAND_PORT);
#endif  // !NO_WIFI

#if defined(HAS_MCP2515)
    // Release the MCP2515 from hardware reset before any SPI traffic. RESET is
    // active-low; pulse it low then high and let the oscillator settle. Without
    // this the chip stays held in reset and begin() returns kNoMCP2515.
    pinMode(MCP2515_RST_PIN, OUTPUT);
    digitalWrite(MCP2515_RST_PIN, LOW);
    delay(10);
    digitalWrite(MCP2515_RST_PIN, HIGH);
    delay(10);

    // Do NOT pass the CS pin to SPI.begin — Arduino-ESP32 would attach it as
    // hardware-SS and fight the library's software-CS control. The ACAN2515
    // library drives CS itself (it calls pinMode(CS, OUTPUT) in begin()).
    SPI.begin(MCP2515_SCK_PIN, MCP2515_MISO_PIN, MCP2515_MOSI_PIN);

    // ACAN2515Settings(quartz_Hz, bitrate). begin() issues the MCP2515 reset,
    // configures bit timing, installs the ISR, and returns 0 on success (a
    // non-zero code is a bitmask of configuration errors — e.g. an impossible
    // bitrate for the given crystal). Default filters accept every frame, which
    // is what we want for a sniffer. Mode tracks CAN_TX_ENABLED so can1 gets the
    // same passive-tap guarantee as can0: ListenOnly by default, Normal only
    // under -DCAN_ALLOW_TX.
    ACAN2515Settings mcp_cfg(MCP2515_QUARTZ_HZ, 250UL * 1000UL);
#if !CAN_TX_ENABLED
    mcp_cfg.mRequestedMode = ACAN2515Settings::ListenOnlyMode;
#endif
    g_mcp_init_err    = g_mcp.begin(mcp_cfg, [] { g_mcp.isr(); });
    g_mcp_initialized = (g_mcp_init_err == 0);
#endif

#if defined(HAS_SD)
    // Probe the microSD once. On success this arms g_sd_active and spawns the
    // writer task; on no-card/failure it's a no-op and the firmware runs as a
    // pure tap. Must precede loop(), which is where the producer is gated.
    sdInit();
#endif

#if !defined(NO_BLE)
    bleInit();
#endif
}

void loop() {
#if defined(KELLY_PASSTHROUGH)
    // Bench passthrough: transparent native-USB <-> Kelly-UART bridge. Lets the
    // Python monitor (solectrac-kelly-monitor.py --port <this board>) talk to the
    // controller through the board to validate the Kelly UART wiring and 5 V-TTL
    // series resistor. Nothing else runs — no CAN, no decode, no SLCAN.
    while (Serial.available())  Serial1.write(Serial.read());
    while (Serial1.available()) Serial.write(Serial1.read());
    return;
#endif
    twai_message_t msg;
    while (twai_receive(&msg, 0) == ESP_OK) {
        // Classic CAN allows DLC 9–15 on the wire (still only 8 data bytes)
        // and the driver passes the raw value through (flagged
        // TWAI_MSG_FLAG_DLC_NON_COMP). Clamp before fan-out so the SLCAN /
        // socketcand formatters never index past msg.data[].
        if (msg.data_length_code > 8) msg.data_length_code = 8;
        g_frames_rx++;
        g_last_frame_ms = millis();
        // J1939 decode applies only to 29-bit frames, but the raw taps
        // forward 11-bit frames too — the TWAI channel may be tapped onto a
        // standard-ID bus (e.g. the BMS UDS port at 0x740/0x748).
        if (msg.extd)
            decodeCAN(msg.identifier, msg.data, msg.data_length_code);
        slcanSendFrame(msg);
        socketcandSendFrame(msg, /*channel=*/0);
#if defined(HAS_SD)
        if (g_sd_active) sdEnqueueRaw(msg);   // no-op enqueue when no card
#endif
    }
#if defined(HAS_MCP2515)
    if (g_mcp_initialized) {
        CANMessage frame;
        while (g_mcp.receive(frame)) {
            g_mcp_frames_rx++;
            // Counts as bus activity for the quiet-sleep timer too: the board
            // must not deep-sleep while CAN A still carries traffic (ext0 wake
            // only watches the TWAI RX pin, so a sleep here would be terminal
            // until CAN B traffic resumes).
            g_last_frame_ms = millis();
            twai_message_t fwd = {};
            fwd.identifier       = frame.id;
            fwd.extd             = frame.ext ? 1 : 0;
            fwd.data_length_code = frame.len <= 8 ? frame.len : 8;
            memcpy(fwd.data, frame.data, fwd.data_length_code);
            socketcandSendFrame(fwd, /*channel=*/1);
        }
    }
#endif
#if defined(HAS_SD)
    // Periodic decoded snapshot at SD_JSON_HZ (default 1 Hz), independent of any
    // client — buildJson() only runs on HTTP/BLE demand otherwise, so an
    // unattended session would log no JSON. Built here on the loop task, so the
    // decoded globals stay single-threaded; only the serialized line crosses to
    // the writer.
    if (g_sd_active) {
        static uint32_t last_json_ms = 0;
        uint32_t now = millis();
        if (now - last_json_ms >= 1000 / SD_JSON_HZ) {
            last_json_ms = now;
            sdEnqueueJson(buildJson(/*pretty=*/false, /*minimal=*/false));
        }
    }
#endif
    canRecoveryTick();
    slcanPoll();
#if !defined(NO_WIFI)
    socketcandPoll();
    dns_server.processNextRequest();
    server.handleClient();
#endif
#if !defined(NO_BLE)
    bleTick();
#endif
    updateLed();
#if defined(HAS_VIN_SENSE)
    updateVinSense();
#endif
#if defined(ENABLE_KELLY)
    kellyPoll();   // non-blocking: advances the Kelly monitor state machine
#endif
#if defined(AUTOSHUTDOWN)
    checkCanQuietSleep();
#endif
}
